export const ru = {
    menu: 'Меню',
    services: 'Услуги',
    other: 'Разное',
    contacts: 'Контакты',

    main_page: 'Главная',
    apps: 'Приложения',
    sites: 'Сайты',
    other_services: 'Доп. услуги',
    cases: 'Кейсы',
    guarantees: 'Гарантии',
    collaboration: 'Сотрудничество',

    we_develop: 'Мы разрабатываем :',
    mobile_apps: 'Мобильные приложения',
    website: 'Веб-сайты',
    interfaces: 'Интерфейсы',
    promotion_strategies: 'Стратегии продвижения',
    web_interfaces: 'Веб-интерфейсы',

    your_goals: 'Каких целей вы хотите достичь?',
    your_goals_desc: `Сразу после обращения мы решаем главную
    проблему – как обеспечить максимальную
    пользу от нашего продукта для клиента.
    Вы получите самое оптимальное решение
    из всех возможных.`,
    go_to_portfolio: 'Перейти к портфолио',

    about_us: 'Кто мы?',
    about_us_desc: `Мы – команда опытных разработчиков,
    которые готовы создать для Вас готовый
    продукт любой сложности, будь то сайт
    или мобильное приложение под разные платформы.
    Быстро, качественно, надёжно.`,

    services_desc: `Наша компания предоставляет полный спектр услуг
    по созданию и продвижению сайтов, мобильных приложений и веб интерфейсов.`,
    mobile_apps_desc: 'Разработаем мобильное приложение под платформы Android или IOS с соблюдением современных стандартов и требований. Все этапы – от создания дизайна до готового продукта.',
    websites_desc: 'Создание стильных и быстрых сайтов – одно из наших основных направлений. От идеи до публикации готового проекта, со строгим соблюдением сроков. Под разный бюджет.',

    more_button: 'Подробнее',

    cases_desc: `Самые свежие работы нашей студии с подробным описанием задачи и её решением.
    `,
    whole_work: 'Смотреть всю работу',
    all_works: 'Все работы',

    about_team: 'О нашей команде',
    about_team_desc: `Создание сайтов и приложений – сложный и многогранный процесс, поэтому в нашей дружной команде работают специалисты разного профиля.`,
    about_team_desc_second: `У нас есть верстальщики, дизайнеры, копирайтеры, менеджер. Это позволяет нам работать над проектом самостоятельно, от начала и до конца, без лишних задержек. Все наши специалисты имеют соответствующее образование, приобрели большой опыт в своей сфере и неоднократно принимали участие в работе над разными проектами различной сложности. Поэтому мы с уверенностью можем утверждать, что и Ваш заказ выполним максимально быстро и качественно.`,

    work_plan: 'План работы',
    work_plan_desc: `За много лет у нас сложился вполне ясный и несложный план работы над проектами. Он состоит из нескольких этапов, на каждом из которых привлекаются разные специалисты нашей команды. Это обеспечивает высокое качество и скорость разработки.`,
    first_stage: 'Этап 1',
    second_stage: 'Этап 2',
    third_stage: 'Этап 3',
    fourth_stage: 'Этап 4',

    interview: 'Интервью',
    interview_desc_intro: `Вы рассказываете нам, что хотите получить, и мы обсуждаем все детали вашего проекта. На этом этапе он приобретает чёткие объёмы, и мы сможем:`,
    interview_desc_list_first: 'Предоставить полную смету по всему проекту.',
    interview_desc_list_second: 'Оценить длительность работ по каждому этапу.',
    interview_desc_list_third: 'Предложить вам некоторые полезные бонусы.',
    interview_desc_outro: `На этом этапе вы получаете полное представление, как будет идти работа и сколько это будет стоить. А мы разрабатываем прозрачный план реализации проекта.`,

    analysis: 'Аналитика',
    analysis_desc_intro: `На этом этапе мы проводим анализ вашего будущего проекта:`,
    analysis_desc_list_first: 'Оцениваем нишу.',
    analysis_desc_list_second: 'Смотрим и анализируем основных конкурентов.',
    analysis_desc_list_third: 'Решаем, какими методами лучше всего будет достичь результата.',
    analysis_desc_outro: `Конечно, это только предварительный этап работы, который вас ни к чему не обязывает. Но здесь уже формируются пути и этапы работы. Появляется набросок плана, на основе которого можно построить дальнейший процесс разработки.`,

    briefing: 'Брифирование',
    briefing_desc_intro: `Этап создания брифа – один из важнейших. Он позволяет больше узнать о целях создания сайта или приложения, а также о результатах, которые должны быть достигнуты. Здесь мы с вашей помощью:`,
    briefing_desc_list_first: 'Узнаём ваши пожелания по дизайну и реализации проекта.',
    briefing_desc_second: 'Получаем информацию о вашем бизнесе для использования в работе.',
    briefing_desc_outro: `Всё это нужно, чтобы готовый продукт был адаптирован именно под ваш бизнес, полностью соответствовал вашим ожиданиям и выполнял свою работу на отлично.`,

    budget: 'Смета',
    budget_desc: `На основе полученной информации мы уже имеем
    полное представление, какой именно проект вы
    хотите получить и какого результата достичь.
    И мы можем составить полный план по его
    реализации – рассчитать, сколько времени это
    займёт у разных специалистов команды и какие
    средства нужно будет использовать.`,
    budget_desc_second: `На этом этапе мы уже можем предоставить вам
    расчёт стоимости работы. Вы получите смету и
    будете точно знать, сколь будет стоить ваш проект.`,

    contract: 'Договор',
    contract_desc: `Заключение договора – важный этап нашего
    сотрудничества.`,
    contract_desc_second: `Он подписывается после того, как
    проект прошёл обсуждение и был утверждён.
    После этого мы приступаем к работе над ним.`,
    contract_desc_third: `Договор – официальный документ, который
    закрепляет обязательства всех сторон. Так
    как мы работаем официально, то составление
    этого документа является обязательным. И мы
    всегда выполняем все указанные в нём пункты.
    Для каждого проекта он отличается, так как
    объём работ и сроки бывают разными.`,

    design_specification: 'Тех.задание',
    design_specification_desc: `Разработка технического задания – основа
    всей дальнейшей работы. Это план, по которому
    будет проходить разработка, которая содержит
    в себе много этапов. Чем подробнее задание,
    тем меньше возникает задержек и прочих
    непредвиденных ситуаций.`,
    design_specification_desc_second: `На этапе проработки технического задания
    становится понятно, какие именно специалисты
    будут привлекаться и будет отведено
    определённое время на их работу. Каждому
    из них будет поставлена конкретная задача.`,

    design: 'Дизайн',
    design_desc: `От дизайнера зависит, как будет выглядеть сайт
    или приложение, понравится ли будущим пользователям.`,
    design_desc_second: `Этот важный этап является одним из ключевых – лишь
    после него к работе подключаются разработчики. И здесь
    наши клиенты уже могут увидеть, как будет выглядеть
    их проект в итоге.`,
    design_desc_third: `Все стадии работы проходят в тесном контакте с клиентом
    и при необходимости вносятся корректировки. Одобренный
    дизайн поступает в дальнейшую работу.`,

    development: 'Разработка',
    development_desc: `Этот этап отличается для каждого проекта и
    представляет собственно его создание. В это
    время все привлечённые специалисты работают
    над своей частью технического задания.
    В итоге получается завершённый продукт – сайт
    или приложение, с полным функционалом, который
    требовался клиенту.`,
    development_desc_second: `Вы, как заказчик, получаете отчёты о ходе работы
    над Вашим проектом и всегда знаете, на каком
    этапе он находится.`,

    testing: 'Тестирование',
    testing_desc: `Создать сайт или приложение – ещё не всё и
    просто передавать его клиентам сразу после
    разработки опрометчиво. Поэтому мы сначала
    проводим тестирование – проверяем готовый
    продукт на разных устройствах, в разных
    условиях, и находим все моменты, когда
    сайт или приложение могут работать неправильно.
    Все найденные проблемы устраняются.`,
    testing_desc_second: `Вы получаете свой проект всесторонне
    проверенным – мы гарантируем качество.`,

    support: 'Сопровождение',
    support_desc: `Даже после сдачи готового проекта некоторое
    время он нуждается в сопровождении. В это
    время наши клиенты получают всестороннюю
    помощь от нашей команды, учатся обращаться
    со своим новым сайтом или приложением,
    узнают, как его можно продвигать в будущем.`,
    support_desc_second: `На этом этапе вы не оказываетесь брошены на
    произвол судьбы наедине со своим проектом и
    всегда можете рассчитывать на нашу помощь
    даже по простым вопросам.`,

    scedule_button: 'Записаться',

    leave_request: 'Оставить заявку',
    leave_request_desc: `Закажите разработку проекта
    или запишитесь на бесплатную консультацию и получите
    наши рекомендации, узнайте стоимость и сроки разработки.`,
    your_name: 'Ваше имя:',
    your_phone: 'Номер телефона:',
    your_email: 'E-mail:',
    message: 'Сообщение',
    attatch_file_button: 'Прикрепить файл',
    request_sent: 'Заявка отправлена',

    error_name: 'Введите имя',
    error_phone: 'Введите корректный телефон',
    error_no_email: 'Введите email',
    error_invalid_email: 'Введите корректный email',
    error_text: 'Напишите Ваше сообщение',

    personal_data_agreement: `Нажимая “Отправить заявку” вы соглашаетесь с порядком обработки `,
    personal_data_agreement_ref: 'персональных данных.',

    adress_first: '127015, Москва,',
    adress_second: 'Большая Новодмитровская улица, 23с6',
    privacy_policy: 'Политика конфиденциальности',
    go_to_map_button: 'Перейти к карте',

    portfolio: 'Портфолио',

    cooperation_desc: `Мы открыты для сотрудничества с другими организациями или специалистами, связанными с разработкой сайтов или программного обеспечения для мобильных устройств. Если вы заинтересованы в этом, то можете оставить здесь свою заявку или связаться с нашим менеджером. Мы рассмотрим ваше предложение в короткие сроки и ответим вам по указанным контактам.`,

    guarantees_desc: `Мы работаем официально и предоставляем своим клиентам различные виды гарантий. Поэтому вы можете быть спокойны насчёт того, что ваш проект будет выполнен строго по заданию, в указанные сроки, и переплачивать ничего сверх договора не придётся. Если мы берёмся за работу, то относимся к ней с полной ответственностью.`,

    guarantees_law: 'Юридические:',
    guarantees_law_desc_first: `После детального изучения проекта и перед тем как начать им заниматься, мы документируем все этапы работы и составляем договор.`,
    guarantees_law_desc_second: `В нём прописаны все сроки и стоимость работ, как по этапам, так и общая.`,
    guarantees_law_desc_third: `Этим мы гарантируем нашим клиентам получение выполненного проекта в срок.`,
    guarantees_law_desc_fourth: `Для нас же это стимул обозначенные сроки строго соблюдать. Также в договоре прописана наша ответственность в случае нарушения нами сроков.`,
    guarantees_tech: 'Технические:',
    guarantees_tech_desc_intro: 'Мы обеспечиваем качество готового проекта:',
    guarantees_tech_desc_list_first: 'При составлении ТЗ учитываем получение наилучших результатов.',
    guarantees_tech_desc_list_second: 'В работе используем только самые современные и надёжные технологии.',
    guarantees_tech_desc_list_third: 'Перед сдачей проводим разностороннее тестирование и устраняем все найденные проблемы.',
    guarantees_tech_desc_outro: 'Передача проекта происходит только после того, как он полностью готов и прошёл многократную проверку.',
    guarantees_manage: 'Организационные:',
    guarantees_manage_desc_intro: 'Процесс разработки у нас полностью прозрачен для клиента:',
    guarantees_manage_desc_list_first: 'Мы регулярно высылаем отчёты по проделанной работе.',
    guarantees_manage_desc_list_second: 'Даём возможность посмотреть, что сделано на данный момент и попробовать готовый функционал.',
    guarantees_manage_desc_outro: 'Вы всегда будете в курсе продвижения работы по вашему заказу и сможете сами видеть процесс, и даже участвовать в нём.',
    guarantees_support: 'Вспомогательные:',
    guarantees_support_desc_intro: 'Даже когда ваш проект готов, и вы его приняли, мы не оставим вас с ним наедине:',
    guarantees_support_desc_list_first: 'Составим план развития или продвижения на ближайшее время.',
    guarantees_support_desc_list_second: 'Будем устранять найденные недостатки в течении года в рамках гарантийного обслуживания.',
    guarantees_support_desc_outro: 'В будущем при необходимости по вашему запросу мы сможем быстро добавлять или изменять функционал – как авторам, нам это будет сделать гораздо проще, чем сторонним программистам.',

    error_happened: `Произошла ошибка`,
    error_beign_fixed: `Мы работаем над решением проблемы`,
    error_to_main_page: `Вернуться на главную`,

    notfound_desc_first: 'ОООООПС! Страницы, которую вы ищите не существует',
    notfound_desc_second: 'Перейдите на главную страницу, пожалуйста',
    notfound_button_label: 'Вернуться на главную',

    contacts_requisites: 'Реквизиты компании',

    service_analytics: "Выявление Ваших потребностей, анализ ЦА и конкурентов, уточнение, планирование и составление ТЗ ",
    service_prototype: "Черновая реализация сайта с бозовой функциональностью для анализа работы сайта",
    service_design: "Разработка главной страницы после определения тематики сайта, утверждение, правки, дизайн внутренних страниц",
    service_development: "Верстка страниц сайта, подключение, настройка, тестирование и отладка ",
    service_publication: "Прохождение модерации и требований для публикации ",
    service_analytics_title: "Аналитика и оценка",
    service_prototype_title: "Прототипирование ",
    service_design_title: "Разработка дизайна",
    service_development_title: "Разработка приложения",
    service_publication_title: "Публикация в сторах",
    job_developer: "Developer",
    job_full_stack: "Full Stack Developer",
    job_front_developer: "Frontend Developer",
    job_backend_developer: "Backend Developer",
    job_mobile_developer: "Mobile Apps Developer",
    job_designer: "UI/UX Designer",
    job_manager: "Project manager",
    job_jenya: "Chief/Backend Developer"
}